Res-firecracker-setEven-randomFront-v66/firecracker_t_10_c_30_frontVcpu_4_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 5047.115ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 4437.013ms, rate sampling interval: 16670ms
  Thread calibration: mean lat.: 5119.682ms, rate sampling interval: 18087ms
  Thread calibration: mean lat.: 4974.580ms, rate sampling interval: 17907ms
  Thread calibration: mean lat.: 5079.340ms, rate sampling interval: 18071ms
  Thread calibration: mean lat.: 5047.072ms, rate sampling interval: 17924ms
  Thread calibration: mean lat.: 5144.965ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 4219.114ms, rate sampling interval: 17022ms
  Thread calibration: mean lat.: 5101.290ms, rate sampling interval: 18006ms
  Thread calibration: mean lat.: 4994.872ms, rate sampling interval: 18022ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.45s    12.72s    0.97m    63.26%
    Req/Sec   233.50      3.17   239.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   28.67s 
 75.000%   39.22s 
 90.000%   50.17s 
 99.000%    0.97m 
 99.900%    0.99m 
 99.990%    0.99m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2001.919     0.000000            1         1.00
   14376.959     0.100000        11744         1.11
   18874.367     0.200000        23481         1.25
   23019.519     0.300000        35217         1.43
   26165.247     0.400000        46975         1.67
   28671.999     0.500000        58655         2.00
   29900.799     0.550000        64542         2.22
   31408.127     0.600000        70411         2.50
   33128.447     0.650000        76284         2.86
   35749.887     0.700000        82126         3.33
   39223.295     0.750000        88030         4.00
   40894.463     0.775000        90916         4.44
   42663.935     0.800000        93857         5.00
   44662.783     0.825000        96805         5.71
   46497.791     0.850000        99724         6.67
   48398.335     0.875000       102666         8.00
   49250.303     0.887500       104147         8.89
   50167.807     0.900000       105616        10.00
   51052.543     0.912500       107077        11.43
   52035.583     0.925000       108545        13.33
   53051.391     0.937500       109977        16.00
   53641.215     0.943750       110754        17.78
   54198.271     0.950000       111470        20.00
   54788.095     0.956250       112197        22.86
   55345.151     0.962500       112937        26.67
   55934.975     0.968750       113663        32.00
   56229.887     0.971875       114003        35.56
   56590.335     0.975000       114389        40.00
   56918.015     0.978125       114776        45.71
   57180.159     0.981250       115133        53.33
   57475.071     0.984375       115472        64.00
   57638.911     0.985938       115652        71.11
   57769.983     0.987500       115845        80.00
   57933.823     0.989062       116031        91.43
   58130.431     0.990625       116205       106.67
   58327.039     0.992188       116395       128.00
   58392.575     0.992969       116480       142.22
   58523.647     0.993750       116575       160.00
   58654.719     0.994531       116685       182.86
   58720.255     0.995313       116752       213.33
   58884.095     0.996094       116867       256.00
   58916.863     0.996484       116894       284.44
   59015.167     0.996875       116949       320.00
   59080.703     0.997266       116990       365.71
   59146.239     0.997656       117031       426.67
   59211.775     0.998047       117072       512.00
   59244.543     0.998242       117097       568.89
   59310.079     0.998437       117133       640.00
   59342.847     0.998633       117162       731.43
   59375.615     0.998828       117179       853.33
   59408.383     0.999023       117196      1024.00
   59441.151     0.999121       117213      1137.78
   59441.151     0.999219       117213      1280.00
   59473.919     0.999316       117230      1462.86
   59506.687     0.999414       117240      1706.67
   59539.455     0.999512       117248      2048.00
   59572.223     0.999561       117259      2275.56
   59572.223     0.999609       117259      2560.00
   59604.991     0.999658       117272      2925.71
   59604.991     0.999707       117272      3413.33
   59604.991     0.999756       117272      4096.00
   59637.759     0.999780       117284      4551.11
   59637.759     0.999805       117284      5120.00
   59637.759     0.999829       117284      5851.43
   59637.759     0.999854       117284      6826.67
   59670.527     0.999878       117289      8192.00
   59670.527     0.999890       117289      9102.22
   59670.527     0.999902       117289     10240.00
   59703.295     0.999915       117296     11702.86
   59703.295     0.999927       117296     13653.33
   59703.295     0.999939       117296     16384.00
   59703.295     0.999945       117296     18204.44
   59703.295     0.999951       117296     20480.00
   59703.295     0.999957       117296     23405.71
   59703.295     0.999963       117296     27306.67
   59736.063     0.999969       117299     32768.00
   59736.063     0.999973       117299     36408.89
   59736.063     0.999976       117299     40960.00
   59736.063     0.999979       117299     46811.43
   59736.063     0.999982       117299     54613.33
   59736.063     0.999985       117299     65536.00
   59736.063     0.999986       117299     72817.78
   59736.063     0.999988       117299     81920.00
   59736.063     0.999989       117299     93622.86
   59736.063     0.999991       117299    109226.67
   59768.831     0.999992       117300    131072.00
   59768.831     1.000000       117300          inf
#[Mean    =    30454.993, StdDeviation   =    12715.336]
#[Max     =    59736.064, Total count    =       117300]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  139524 requests in 1.00m, 57.83MB read
  Socket errors: connect 0, read 0, write 0, timeout 20
Requests/sec:   2325.17
Transfer/sec:      0.96MB